[
   {
      "title": "v0.4.12",
      "free": false,
      "date": "2025-09-07",
      "content": "- Add animated sex scene for Marie.\n- Add more Zahra story, also come with a new static sex scene.\n- Add cum sprite overlay for Zahra after sex scene.\n- Add accessibility buttons on dialogue balloon. This is mainly for mobile version.\n- Add cheat menu.\n- Add german translation.\n- Adjust translation in French and Indonesian.\n- Balancing:\n\t- Reduce item sold requirement for Zahra from 30 to 15.\n\t- Reduce money given requirement for Rina at level 6 from 6000 to 5000.\n\t- Reduce Rina H level requirement.\n- Bugfixes:\n\t- Fix auction ambient sound not stopped correctly when player exit the auction early.\n\t- Fix free item given by NPC become broken after the game restart.\n\t- Fix holding skip dialogue button when cumming at sex scene causing the cum count increasing non stop.\n\t- Fix french language showing chinese font at some dialogue."
   },
   {
      "title": "v0.4.11-hotfix",
      "free": false,
      "date": "2025-08-26",
      "content": "- Fix Mila \"See h scene\" requirement not going up, which make leveling her up impossible.\n- Fix some dialogue disabled option being showed."
   },
   {
      "title": "v0.4.10-hotfix",
      "free": false,
      "date": "2025-08-25",
      "content": "- Fix freeze at startup"
   },
   {
      "title": "v0.4.9",
      "free": false,
      "date": "2025-08-25",
      "content": "- Add Rina Live2D sex scene.\n- Add a way to increase h level at home. This feature can be unlocked by getting special item from auction house.\n- Add more localization support on remaining UIs.\n- Add spanish and russian language. Same as other language, it's still translate from AI for now.\n- Add disclaimer opening screen at the start of the game.\n- Balancing:\n\t- Reduce Rina H level point requirement\n\t- Increase horny mood chance on the customer.\n- Bug fix:\n\t- Fix broken repair system on Mila at level 6.\n\t- Fix staff upgrade button being enabled when the shop is still open.\n\t- Fix breath effect on customer not working on the sprite overlay(e.g cum)."
   },
   {
      "title": "v0.4.8",
      "free": false,
      "date": "2025-08-11",
      "content": "- Add Kline animated sex scene.\n- Changed the game font is to support more language.\n- Integrate localization to the game.  This is an ongoing process, so there will be some UI text that is not yet translated.\n- Add french, simplified chinese, and indonesian localization. The translation is made by AI, so there will be mistakes. I'm planning to get it fixed by native speaker in future, so I suggest you to use the english for now unless it's needed. If you want to suggest a translation fix, I'm open to it though. :)\n- A little adjustment on Miyuki sex scene dialogue.\n- Bug fix:\n\t- Enable breath effect on Miyuki sex scene"
   },
   {
      "title": "v0.4.7",
      "free": false,
      "date": "2025-07-27",
      "content": "- Added Miyuki Live2D sex animation.\n- Added Level 2 membership at the auction house. Auctions now start with cheaper items at Level 1 and unlock more expensive items at Level 2, along with additional sexy features.\n- Added several improvements to the auction (SFX and UI).\n- Added new BGM for the home screen, sex scenes, and auction house.\n- Added ambient sounds and BGM to the prologue.\n- Removed some content due to recent drama in the adult game market. The removed content includes:\n    - Rina’s toggleable relationship with the player.\n    - Passed-out option for Jacqueline.\n    - Sleep sex with Cara.\n- Added corrupted variant text for:\n    - Adelee’s boob suck scene.\n    - Gabrielle in the shop (buy/sell).\n    - Gabrielle’s handjob scene.\n    - Gabrielle’s blowjob scene.\n- Bug Fixes:\n    - Fixed Cassia’s Live2D grope scene expression transition being too slow.\n    - Fixed the month and week not displaying correctly in the auction house.\n    - Fixed audio volume being louder than intended.\n    - Attempted to fix \"Bought at\" appearing when selling to a customer.\n    - Fixed broken navigation with arrow keys in the home screen and auction house.\n    - Fixed expressions not working when an outfit variant is active (e.g., the topless version of an outfit).\n    - Fixed Rina wearing locked outfit on level 1 and 2."
   },
   {
      "title": "v0.4.6",
      "free": false,
      "date": "2025-07-13",
      "content": "- Add Cara live2d sex scene.\n- Add basic auction game mechanic. This is still very early version of the auction house, a lot of things are still unfinished, I apologize if it cause any issue.\n- Add lactation to Rina sex scene sprite and adjust her scene dialogue a little bit.\n- Add corrupted dialogue variant for Gabrielle sex scene, corrupted dialogue can be selected when the girl's h level is 5 (usually). The other girl will get their corrupted version soon.\n- Balancing:\n\t- Increase Mila repair chance for level 4(40%->45%) and 5(40%->50%)\n\t- Increase h-point when a girl is getting naked from 4 to 5\n\t- Customer that come to the shop with exposed private parts now increase more h-point (just a little bit)"
   },
   {
      "title": "v0.4.5",
      "free": false,
      "date": "2025-06-29",
      "content": "- Add live2d sex scene for Gabrielle.\n- Add auction house that can be visited after shop closed. The actual auction is still on development though.\n- Add new character Talia, she will work as an auctioneer at auction house.\n- Bug fixes:\n\t- Fix clipping issue on Jacqueline sex scene\n\t- Fix some issue with Rina sex scene dialogue\n\t- Fix Rina sex scene not started on ask to penetrate option"
   },
   {
      "title": "v0.4.4",
      "free": false,
      "date": "2025-06-15",
      "content": "- Add new animated sex scene for Jacqueline.\n- Adjusted Louisa’s Live2D sex scene to keep her breasts from moving excessively due to the table’s position in the scene.\n- Replaced the cum sprite in Louisa’s Live2D sex scene.\n- Bugfixes:\n\t- Fix cum count on npc UI not working."
   },
   {
      "title": "v0.4.3",
      "free": false,
      "date": "2025-06-01",
      "content": "- Add Louisa animated sex scene replacing her old from behind sex scene. The scene dialogue also altered a bit.\n- Add Mila static handjob scene. The scene can be unlocked when she reached level 6.\n- Add 2 new outfits for Mila at level 6.\n- Add h level to NPC, same gameplay mechanic with customer h level. Every h point recovered from the NPC will contribute to the NPC h level.\n- Add unlockable outfits for Rina, the unlock condition is displayed in the NPC menu. She will also start wearing the unlocked outfit.\n- Bugfix:\n\t- Fix Rina empty dialogue on her sex scene after cumming more than 5 times.\n\t- Fix Rina always using the same outfit at level 6-9 ;)"
   },
   {
      "title": "v0.4.2",
      "free": false,
      "date": "2025-05-15",
      "content": "- Add new animated sex scene for Adelee, replacing her static cowgirl scene. \n- Add new sex scene (static image) for Rina, increasing her level to 9 max which unlock mother-son relationship on her. It's more like adopted son though. :) This will also have a slight different dialogue on her previous scene.\n- Add sfx integration to live2d animation player. Integrated with Adelee new scene of course ;)\n- Add speed integration to live2d animation player.\n- Add h-level integration to the dialogue module, basically this enable the girl to have the third option on their scene based on their h-level. The content will come in future.\n- Bug Fixes:\n\t- Fix NPC outfit variant text displaying the incorrect outfit variant.\n\t- Fix clipping issue on Rina outfit sprites.\n\t- Fix scaling issue with live2d player.\n- Balancing:\n\t- Reduce Mila weekly cost."
   },
   {
      "title": "v0.4.0",
      "free": false,
      "date": "2025-04-26",
      "content": "- Add live2d integration to the dialogue and scene module on the game. Basically, this will enable all customer and NPC have their live2d animation scene implemented easily in the future.\n- Add first animated scene for Cassia (replacing Cassia breast grope scene).\n- Tweak Cassia's dialogue due to how her animated scene flow now."
   },
   {
      "title": "v0.3.21",
      "free": false,
      "date": "2025-04-07",
      "content": "- Add Mila level 4 and 5.\n- Add footjob scene for Mila.\n- Add sound effects to all the girl scenes, except Cassia. I'm planning to rework Cassia scene into animation, so if things go well, the sound will be implemented at that phase.\n- Add sound effects to notifications.\n- Add Credit button on the main menu.\n- Bug fixes:\n\t- Try to fix \"Bought At\" appearing on selling customer.\n\t- Remove placeholder text on the girls' dialogue.\n\t- Fix several typos in the dialogues.\n\t- Fix upgrade staff not updating the staff description until next day."
   },
   {
      "title": "v0.3.20-hotfix",
      "free": false,
      "date": "2025-03-28",
      "content": "- Fix the hardlock when the game tries to spawn an NPC and finds no eligible NPC."
   },
   {
      "title": "v0.3.19",
      "free": false,
      "date": "2025-03-25",
      "content": "- Add new titjob scene for Rina.\n- Add Mila story progress, increasing her max level to 3. Her level 3 also unlock a new outfit for her.\n- Improvements have been made to NPC generation, guaranteeing their spawn within 3 days. A weighted spawn rate has also been applied to ensure a more balanced spawn rate, minimizing the impact of bad RNG and preventing certain NPCs from spawning.\n- Add an incremental chance for each failed attempt at the Mila repair event. In the current state, there should be at least one repair made per week. All other chance-based events in the future should use this new method to prevent bad RNG from happening.\n- Items can now be marked as \"not for sale\" to prevent customers from buying them. \n\t- This feature is intended to help the player save items that they want Mila to repair.\n\t- Customers will try to search for available items up to 3 times, and if all of the items are not for sale, the customer will decide not to buy anything.\n\t- If the player marks all of their items as \"not for sale\", this will not prevent buying customers from spawning. Instead, they will still spawn, decide to not buy anything, and then leave, using up the day's customer quota.\n- Balancing:\n\t- Reduce Mila weekly cost at all level.\n- Bug Fixes:\n\t- Fix the issue where Mila's repaired item shows a reduced estimation compared to before the repair.\n\t- Fix Cara crop top with skirt outfit showing wrong outfit."
   },
   {
      "title": "v0.3.18",
      "free": false,
      "date": "2025-03-09",
      "content": "- New staff Mila, Rina's daughter, will be unlocked after Rina reaches level 7, the current max level for her. Mila will repair items in your inventory until a certain condition based on her level. This enables the player to buy an item in bad condition and let Mila repair it to get a higher profit. Upon successful repair, Mila will trigger a notification that shows the item's name and its estimated value before and after the repair (your stats still determine the accuracy of this estimation).\n- Shop is now upgradable to level 4 to support 2 staff at once and bigger inventory.\n- Add notification UI on the left of the screen, currently it will remind the player for shop weekly expenses at day 7, and when Mila successfully repaired an item in the shop.\n- Balancing:\n\t- Reduce the requirement for Zahra initial spawn.\n\t- Adjust shop stats at level 1-3.\n- QoL:\n\t- All customer scene now showed on the dialogue.\n\t- Tweak the focus on the shop UI while navigating using the arrow keys and Tab/Shift+Tab.\n\t- Add checkmark on customer scene that have been played at least once.\n\t- Add a very simple animation in player h bar\n- Bug fixes:\n\t- Fix customer scenes not showing repeat option.\n\t- Fix mood modal showing the actual mood information when it's actually hidden.\n\t- Fix wrong condition text color in inventory menu.\n\t- Fix weekly cost text moved to the left on max level staff.\n\t- Fix upgrade button showed on a staff that is not hired.\n\t- Fix Adelee max level capped at 4, preventing her naked outfit to be unlocked"
   },
   {
      "title": "v0.3.17",
      "free": false,
      "date": "2025-02-24",
      "content": "- More of Rina's story has been added, along with a new scene where MC can masturbate to her.\n- Rina will have more outfit options as her story progresses.\n- The customer and NPC menu has been updated to match the staff menu layout, supporting outfit variants for customers and NPCs.\n- Asking a customer to get naked will now strip them if their outfit has a strip variant (topless, pantless, exposed). The customer will be fully naked after being asked a second time. This is currently only available on some of Cara's new outfits, with more to come in future updates.\n- 9 new outfits have been added for Cara, some of which have variants like topless or pantless.\n- New expressions have been added for Cara.\n- QoL:\n\t- NPCs are now reordered based on their unlock timing.\n- Bug fixes:\n\t- UI bugs on the customer, NPC, and staff menu UI have been fixed.\n\t- Wrong name in Cassia dialogue."
   },
   {
      "title": "v0.3.16",
      "free": false,
      "date": "2025-02-09",
      "content": "- Add Marie sex scene.\n- Add sneak peek for new NPC, Rina, a single mother. The story is still on development.\n- Add cum on Marie after her sex scene.\n- Customer will stay naked after the scene end, unless the dialogue tell them otherwise.\n- QoL:\n\t- Reduce dialogue box size on some preset.\n- Bug fixes:\n\t- Fix Kline sex scene start over bugged to Jacqueline sex scene.\n\t- Fix price confirmation bug on price higher than 1000.\n\t- Fix unhandled branch dialogue bug when player reject customer after scene price bargain, and then accept customer offer to reconsider their offer by getting naked."
   },
   {
      "title": "v0.3.15-hotfix",
      "free": false,
      "date": "2025-01-29",
      "content": "- Bug fixes:\n\t- Fix several game data issues on new game, one of the problem is perk not unlocking until restart.\n\t- Fix mood button showing when the mood is not unlocked yet.\n\t- Fix Bethany unlocked at day 6 instead of 5.\n\t- Hide UI when an event start at the home, for example when Cassia is explaining about mood on the customers.\n\t- Fix spamming space on the start of an event on the home skipping it entirely to next day.\n- QoL:\n\t- Add confirmation box when you're about to spend at least 3 times of the item estimation when buying from the customer."
   },
   {
      "title": "v0.3.14",
      "free": false,
      "date": "2025-01-25",
      "content": "- Add new sex scene for Adelee.\n- Add cum on customer sprite after scene for Adelee and Kline.\n- Add Horny mood for customers. Currently, for most of the customer, this mood will unlock at h level 4. When the customer is in horny mood, they have higher chance to offer scene to player, and instead of bargaining for better price with player, they are willing to accept worse price for a steamy exchange, meaning higher profit. For example when the customer is selling, they will lower the price if the player want to bang her.\n- Add horny dialogue variant for all the customers. There might be some issue with this since there's a lot of dialogue flow changed, let me know if you experiencing any issues.\n- Change how \"ask naked\" choice works on customers, now the player can choose what to do after the customer get naked rather than fixed to giving a counter offer. 🙌\n- Add ask to get naked option on buying customer on h level 3(with the perk unlocked). On selling customer this option is available as soon as the perk is unlocked.\n- Add ask to get naked choice on Gabrielle sell dialogue.\n- QoL:\n\t- Add mood explanation button at the right of the mood text.\n- Balancing:\n\t- Increasing h level on customer now will lower their \"scene price\".\n- Bug Fixes:\n\t- Fix customer not offering scene to player due to broken perk check code.\n\t- Fix rejecting customer scene offer leading to premature dialogue end."
   },
   {
      "title": "v0.3.13-hotfix",
      "free": false,
      "date": "2025-01-15",
      "content": "- Change how the game exported to prevent false positive virus detection by windows defender, I hope it's not coming back.\n- Add ask naked on Louisa sell dialogue.\n- Balancing:\n\t- Increase NPC spawn chance.\n- Bug fixes:\n\t- Fix Cassia addressing MC as Pawloo instead of the custom name.\n\t- Fix player perk not unlocking properly.\n\t- Fix customer h-bar UI not showing on the day intoxicating cum perk unlocked.\n\t- Fix customer h-bar UI not updated right after the scene end.\n\t- Fix several bugs on NPC Blacklist feature:\n\t\t- Right click to toggle blacklist not working.\n\t\t- NPC Blacklist system itself not working properly.\n\t\t- Removing NPC blacklist not working."
   },
   {
      "title": "v0.3.12",
      "free": false,
      "date": "2025-01-12",
      "content": "- Add new sex scene for Kline.\n- Add H level to the customer (from intoxicating cum perk).\n- Add free customer outfit unlock based on customer H level or other stats. Most of the current customer outfit now have free unlock condition.\n- Add NPC blacklist, can be unlocked from Keira the bouncer at level 3.\n- Increase Keira max level to level 3 which unlock:\n\t- New outfit, and older outfit variant\n\t- NPC blacklist feature (max 2).\n- Add variant outfit system, this type of outfit variant is applied only on Keira, for now.\n- Balancing:\n\t- Reduce cost of upgrading stats.\n\t- Increase some outfit cost in response of free unlock feature."
   },
   {
      "title": "v0.3.11-hotfix",
      "free": false,
      "date": "2025-01-07",
      "content": "- Fix Zahra BJ start over leading to different scene.\n- Fix Bethany dialogue showing some bb code."
   },
   {
      "title": "v0.3.10-hotfix",
      "free": false,
      "date": "2024-12-29",
      "content": "-Fix Start Over on Thea sex scene leading to another scene.\n- Fix Bethany cum count bug."
   },
   {
      "title": "v0.3.9",
      "free": false,
      "date": "2024-12-29",
      "content": "- Add more of Zahra story with her blowjob scene in it.\n- Add Thea sex scene.\n- Add 18 new items\n- Add new perk \"Intoxicating Cum\" which can be obtained from Zahra story. When this perk is unlocked, player can make the customers more corrupted(still on development), for example, increasing the corruption will unlocking new mood and give free outfit unlock.\n- Add repeat dialogue for Louisa sex scene.\n- Add cum on customer sprite after scene:\n\t- Miyuki blowjob, titjob, and sex scene.\n\t- Louisa sex scene.\n\t- Jacqueline handjob, blowjob, and sex scene.\n\t- Cara blowjob, and sex scene.\n\t- Gabrielle handjob, blowjob, and sex scene.\n\t- Thea blowjob, titjob, and sex scene\n- Hover at button at the left of item on the table to move the item to the right if needed ;)\n- Add simple text animation on the money when it's changed.\n- Balancing:\n\t- Change cum times needed for soothing ejaculation level 1 from 20 to 30.\n- QoL:\n\t- Add separate dialogue box background color when the girl is talking.\n- Bug fixes:\n\t- Fix typo in Adelee sell dialogue.\n\t- Fix saved number in data tracking for scene h point is after reduction, should be before reduction.\n\t- Fix NPC scene not unlocking properly at the start of a new day.\n\t- Fix customer scene not unlocking properly.\n\t- Fix some game data not saved properly."
   },
   {
      "title": "v0.3.8",
      "free": false,
      "date": "2024-12-14",
      "content": "- New scene:\n\t- Cara sleep sex\n\t- Cara standing sex\n\t- Gabrielle doggy style\n- New npc:\n\t- Zahra\n- Add customer mood. This feature will be unlocked at week 2 when Cassia is talking to you about it at home. Higher insight will increase the chance for mood to be revealed. Current mood in the game are:\n\t- Normal: the default mood\n\t- Stingy: the customer will have worse price (high when selling, low when buying)\n\t- Generous: the customer will have better price\n\t- In a rush: the customer wouldn't bargain with player but will more tolerate the price given to her. The opening dialogue also slightly changed for some customer when they have this mood.\n- Add new perk:\n\t- Soothing cum: Scene will reduce more h point.\n- Remove old customer assets to decrease the game file size."
   },
   {
      "title": "v0.3.7",
      "free": false,
      "date": "2024-12-01",
      "content": "- Add upgradable shop, currently shop level will affect these stats:\n\t- Item storage\n\t- Daily customer count\n\t- Max active staff, but right now, there's only 1 staff available\n\t- Weekly maintenance cost\n\t- Unlock new content (for future update)\n- Add missionary sex position for Jacqueline with passed out option.\n- Restructure Jacqueline sex scene, adding missionary position and option to change the position in the scene.\n- QoL:\n\t- Change the response position in dialogue so it doesn't block the center of the screen.\n\t- Add new panel preset to swap the position of the dialogue and response option.\n- Bug fixes:\n\t- Fix typo in Louisa sex scene\n\t- Fix Louisa sex scene flag not working as intended."
   },
   {
      "title": "v0.3.6-hotfix",
      "free": false,
      "date": "2024-11-17",
      "content": "- Fix Louisa sex scene cg still showing when another scene played after it in the same day\n- Louisa sex scene dialogue adjustment"
   },
   {
      "title": "v0.3.5",
      "free": false,
      "date": "2024-11-16",
      "content": "- Add 2 new sex scenes for Jacqueline and Louisa.\n\t- Cowgirl position for Jacqueline\n\t- Cowgirl and from behind position for Louisa\n- Add facial expression for these scenes:\n\t- Kline titfuck.\n\t- Jacqueline handjob.\n\t- Louisa nursing handjob.\n- Add multiple cum option for these scene:\n\t- Miyuki titfuck.\n\t- Kline titfuck.\n\t- Jacqueline handjob.\n\t- Jacqueline blowjob.\n\t- Gabrielle blowjob.\n\t- Louisa nursing handjob.\n- Adjustment on cum buildup image for Miyuki sex scene.\n- Add customer & npc scene list and count on their menu.\n- Bug fixes:\n\t- Fix price input cannot be deleted until it's empty.\n\t- Fix typo in customer dialogues.\n\t- Perk unlock string is now hidden when the perk is unlocked.\n\t- Fix shop maintenance cost is not working.\n\t- Fix staff weekly cost not working."
   },
   {
      "title": "v0.3.4",
      "free": false,
      "date": "2024-11-02",
      "content": "- Add 1 new scene Miyuki, the new scene will be the second scene, so the previous sex scene moved as the third scene.\n- Add coom buildup variant for Miyuki sex scene.\n- Add upgrade system to staff, currently only with money.\n- Add body inspection(grope) scene for Keira(bouncer) at level 2.\n- Staff will pick an outfit for the day, the outfit will be randomly picked from unlocked and not blacklisted outfits.\n- Add unlock staff outfit system. Keira(bouncer) outfits will be locked at level 1, and 3 of her outfit can be unlocked at level 2.\n- Add customer outfit blacklist for bouncer at level 2, the bouncer can blacklist customer outfits until 1 active outfit remaining per customer.\n- Add staff outfit blacklist, for staff outfit blacklist, bouncer is not needed, it will always active since you are the boss.\n- Add ability for customers to offer scene to the player when they are selling. It was only available to Miyuki on previous version. The ability and chance to offer scene will differ based on the customer personality (around 15-35%).\n- Add 5 new outfit for Marie.\n- Miyuki chance to offer scene reduced from 50% to 35%.\n- At day 3, add dialogue at home that introduce shop expenses.\n- Adjustment on the tutorial information to keep up with current content.\n- Bug fixes:\n\t- Fix customer blacklist is still working when the bouncer is fired after setting the blacklist list\n\t- Fix typo in several Miyuki scenes\n\t- Fix Miyuki expression not changing in her scene\n- QoL:\n\t- Right click on the customer slot will blacklist the customer\n\t- Right click on the customer outfit slot will blacklist the customer outfit, also work on staff outfit.\n\t- Add information modal for blacklist customer and customer outfit\n- Technical Stuff:\n\t- More unit test to cover more human(me) error"
   },
   {
      "title": "v0.3.3-hotfix",
      "free": false,
      "date": "2024-10-23",
      "content": "- Fix crash from NPC events\n- Fix wrong Bethany unlock condition text"
   },
   {
      "title": "v0.3.2-hotfix",
      "free": false,
      "date": "2024-10-20",
      "content": "- Add option for first time or repeat dialogue on all customers scene. Previously only available to Miyuki.\n- Bug fixes:\n\t- Fix scene option is showing when the required perk is not acquired yet, choosing the option will lead to customer exit the shop immediately.\n\t- Fix customer offering scene to player when the perk is not unlocked yet.\n\t- Disable daily maintenance cost (it was a testing code for me testing daily expenses)"
   },
   {
      "title": "v0.3.1",
      "free": false,
      "date": "2024-10-19",
      "content": "- Add new unlockable customer Miyuki. She comes with 17 outfit and 2 scenes. There's also 2 new improvement feature coming with her, which will be applied to other customers in next update.\n\t- Customer can offer their scene to the player. Miyuki have this set at 50%.\n\t- Customer scene have first time and repeat option\n- Lillian at level 4 now have 50% chance to give player a random low price item.\n- Changed how customer data is tracked, customer data will be reset because of this. This is required as a base for changeable customer name, and future(maybe) swappable customer personality.\n- Change how customer scene are unlocked, this will make all customer scenes back to locked (you need to play the first scene again to unlock it). This will also make certain customer scene can be unlocked with special condition, for future content.\n- Fix some grammar mistakes on the prologue\n- QoL update:\n\t- Dialogue panel preset now remembered and saved.\n\t- Add keyboard key function on summary page and management UI.\n\t- Add blacklist indicator on the blacklisted customer.\n- Bug fixes:\n\t- Fix locked customer, NPC and staff showing their available/default outfit\n\t- Fix price input allowing letter to show\n\t- Fix starting price on buying customer is started by current money instead of the item expected price. This bug happened on buying customer after a selling customer exit the shop.\n\t- Fix money UI not updated in the shop\n\t- Fix background and cassia sprite messed up in home\n\t- Fix customer outfit UI not resetting properly when reopened\n\t- Fix customer outfit name changing when unlocking an outfit\n\t- Fix typo on customer dialogues\n\t- Fix several bugs with summary calculations\n\t- Fix \"better focus\" perk not unlocked properly"
   },
   {
      "title": "v0.3.0",
      "free": false,
      "date": "2024-10-06",
      "content": "- Change day system to day-week-month. Old day will be converted automatically at the start of the game.\n- Add summary report at the end of the day. There's daily, weekly, and monthly report added.\n- Add staff menu. Player can manage(hire, fire, and talk) their staff at the end of the day.\n- Add new staff (bouncer), she will enable customer blacklist feature if active, she also will make customer at the shop more patient. The dialogue and scene on the staff will come in later release.\n- Add blacklist feature when bouncer is in active staff. Current maximum customer that can be blacklisted is 2 (will be upgradable in future).\n- Add weekly staff and shop maintenance cost.\n- Add new information at tutorial about auto save, and the new staff feature.\n- H reduction now will get higher depend on the event level\n- Adjustment on customer management UI for blacklist feature."
   }
]
