[
   {
      "title": "v0.4.14",
      "free": false,
      "date": "2025-09-21",
      "content": "- Add animated sex scene for Zahra.\n- Rework Cassia sprite (it was using the old method and code), the new sprite also support expression, outfit, like other NPC. In this update, only expression is integrated, the outfits will come soon for her.\n- Rework the prologue story, this will change MC relationship with Cassia from a complete stranger in Pawnia to an old friend from Earth. If you want to read the story you can start the game as a new game, and just make sure don't continue to the game after the prologue end. \n- Rewrite Cassia interaction on the house (still WIP).\n- Rework Jacqueline hand job scene image. I feel this one need to be done before making it animated in future.\n- Add Hall of Gratitude. This place is dedicated to recognizing this game supporters. In the future, I plan to add NPC and a little bit interaction.\n- Optimization:\n\t- Optimize VRAM usages on several areas. This should make the game load faster and will allow me to use higher resolution asset. I hope it doesn't break anything. 😅\n- Bugfixes:\n\t- Fix Cassia initial blowjob scene not unlocking properly.\n\t- Fix Cassia grope scene on \"ask naked\" option not using the animated grope scene.\n\t- Fix typo on Zahra missionary repeat dialogue."
   },
   {
      "title": "v0.4.13-hotfix",
      "free": false,
      "date": "2025-09-07",
      "content": "- Fix hardlock on scene when MC is cumming too fast with the skip dialogue toggled on 😂"
   },
   {
      "title": "v0.4.12",
      "free": false,
      "date": "2025-09-07",
      "content": "- Add animated sex scene for Marie.\n- Add more Zahra story, also come with a new static sex scene.\n- Add cum sprite overlay for Zahra after sex scene.\n- Add accessibility buttons on dialogue balloon. This is mainly for mobile version.\n- Add cheat menu.\n- Add german translation.\n- Adjust translation in French and Indonesian.\n- Balancing:\n\t- Reduce item sold requirement for Zahra from 30 to 15.\n\t- Reduce money given requirement for Rina at level 6 from 6000 to 5000.\n\t- Reduce Rina H level requirement.\n- Bugfixes:\n\t- Fix auction ambient sound not stopped correctly when player exit the auction early.\n\t- Fix free item given by NPC become broken after the game restart.\n\t- Fix holding skip dialogue button when cumming at sex scene causing the cum count increasing non stop.\n\t- Fix french language showing chinese font at some dialogue."
   },
   {
      "title": "v0.4.11-hotfix",
      "free": false,
      "date": "2025-08-26",
      "content": "- Fix Mila \"See h scene\" requirement not going up, which make leveling her up impossible.\n- Fix some dialogue disabled option being showed."
   },
   {
      "title": "v0.4.10-hotfix",
      "free": false,
      "date": "2025-08-25",
      "content": "- Fix freeze at startup"
   },
   {
      "title": "v0.4.9",
      "free": false,
      "date": "2025-08-25",
      "content": "- Add Rina Live2D sex scene.\n- Add a way to increase h level at home. This feature can be unlocked by getting special item from auction house.\n- Add more localization support on remaining UIs.\n- Add spanish and russian language. Same as other language, it's still translate from AI for now.\n- Add disclaimer opening screen at the start of the game.\n- Balancing:\n\t- Reduce Rina H level point requirement\n\t- Increase horny mood chance on the customer.\n- Bug fix:\n\t- Fix broken repair system on Mila at level 6.\n\t- Fix staff upgrade button being enabled when the shop is still open.\n\t- Fix breath effect on customer not working on the sprite overlay(e.g cum)."
   },
   {
      "title": "v0.4.8",
      "free": false,
      "date": "2025-08-11",
      "content": "- Add Kline animated sex scene.\n- Changed the game font is to support more language.\n- Integrate localization to the game.  This is an ongoing process, so there will be some UI text that is not yet translated.\n- Add french, simplified chinese, and indonesian localization. The translation is made by AI, so there will be mistakes. I'm planning to get it fixed by native speaker in future, so I suggest you to use the english for now unless it's needed. If you want to suggest a translation fix, I'm open to it though. :)\n- A little adjustment on Miyuki sex scene dialogue.\n- Bug fix:\n\t- Enable breath effect on Miyuki sex scene"
   },
   {
      "title": "v0.4.7",
      "free": false,
      "date": "2025-07-27",
      "content": "- Added Miyuki Live2D sex animation.\n- Added Level 2 membership at the auction house. Auctions now start with cheaper items at Level 1 and unlock more expensive items at Level 2, along with additional sexy features.\n- Added several improvements to the auction (SFX and UI).\n- Added new BGM for the home screen, sex scenes, and auction house.\n- Added ambient sounds and BGM to the prologue.\n- Removed some content due to recent drama in the adult game market. The removed content includes:\n    - Rina’s toggleable relationship with the player.\n    - Passed-out option for Jacqueline.\n    - Sleep sex with Cara.\n- Added corrupted variant text for:\n    - Adelee’s boob suck scene.\n    - Gabrielle in the shop (buy/sell).\n    - Gabrielle’s handjob scene.\n    - Gabrielle’s blowjob scene.\n- Bug Fixes:\n    - Fixed Cassia’s Live2D grope scene expression transition being too slow.\n    - Fixed the month and week not displaying correctly in the auction house.\n    - Fixed audio volume being louder than intended.\n    - Attempted to fix \"Bought at\" appearing when selling to a customer.\n    - Fixed broken navigation with arrow keys in the home screen and auction house.\n    - Fixed expressions not working when an outfit variant is active (e.g., the topless version of an outfit).\n    - Fixed Rina wearing locked outfit on level 1 and 2."
   },
   {
      "title": "v0.4.6",
      "free": false,
      "date": "2025-07-13",
      "content": "- Add Cara live2d sex scene.\n- Add basic auction game mechanic. This is still very early version of the auction house, a lot of things are still unfinished, I apologize if it cause any issue.\n- Add lactation to Rina sex scene sprite and adjust her scene dialogue a little bit.\n- Add corrupted dialogue variant for Gabrielle sex scene, corrupted dialogue can be selected when the girl's h level is 5 (usually). The other girl will get their corrupted version soon.\n- Balancing:\n\t- Increase Mila repair chance for level 4(40%->45%) and 5(40%->50%)\n\t- Increase h-point when a girl is getting naked from 4 to 5\n\t- Customer that come to the shop with exposed private parts now increase more h-point (just a little bit)"
   },
   {
      "title": "v0.4.5",
      "free": false,
      "date": "2025-06-29",
      "content": "- Add live2d sex scene for Gabrielle.\n- Add auction house that can be visited after shop closed. The actual auction is still on development though.\n- Add new character Talia, she will work as an auctioneer at auction house.\n- Bug fixes:\n\t- Fix clipping issue on Jacqueline sex scene\n\t- Fix some issue with Rina sex scene dialogue\n\t- Fix Rina sex scene not started on ask to penetrate option"
   },
   {
      "title": "v0.4.4",
      "free": false,
      "date": "2025-06-15",
      "content": "- Add new animated sex scene for Jacqueline.\n- Adjusted Louisa’s Live2D sex scene to keep her breasts from moving excessively due to the table’s position in the scene.\n- Replaced the cum sprite in Louisa’s Live2D sex scene.\n- Bugfixes:\n\t- Fix cum count on npc UI not working."
   },
   {
      "title": "v0.4.3",
      "free": false,
      "date": "2025-06-01",
      "content": "- Add Louisa animated sex scene replacing her old from behind sex scene. The scene dialogue also altered a bit.\n- Add Mila static handjob scene. The scene can be unlocked when she reached level 6.\n- Add 2 new outfits for Mila at level 6.\n- Add h level to NPC, same gameplay mechanic with customer h level. Every h point recovered from the NPC will contribute to the NPC h level.\n- Add unlockable outfits for Rina, the unlock condition is displayed in the NPC menu. She will also start wearing the unlocked outfit.\n- Bugfix:\n\t- Fix Rina empty dialogue on her sex scene after cumming more than 5 times.\n\t- Fix Rina always using the same outfit at level 6-9 ;)"
   },
   {
      "title": "v0.4.2",
      "free": false,
      "date": "2025-05-15",
      "content": "- Add new animated sex scene for Adelee, replacing her static cowgirl scene. \n- Add new sex scene (static image) for Rina, increasing her level to 9 max which unlock mother-son relationship on her. It's more like adopted son though. :) This will also have a slight different dialogue on her previous scene.\n- Add sfx integration to live2d animation player. Integrated with Adelee new scene of course ;)\n- Add speed integration to live2d animation player.\n- Add h-level integration to the dialogue module, basically this enable the girl to have the third option on their scene based on their h-level. The content will come in future.\n- Bug Fixes:\n\t- Fix NPC outfit variant text displaying the incorrect outfit variant.\n\t- Fix clipping issue on Rina outfit sprites.\n\t- Fix scaling issue with live2d player.\n- Balancing:\n\t- Reduce Mila weekly cost."
   },
   {
      "title": "v0.4.0",
      "free": false,
      "date": "2025-04-26",
      "content": "- Add live2d integration to the dialogue and scene module on the game. Basically, this will enable all customer and NPC have their live2d animation scene implemented easily in the future.\n- Add first animated scene for Cassia (replacing Cassia breast grope scene).\n- Tweak Cassia's dialogue due to how her animated scene flow now."
   }
]
