[
   {
      "title": "v0.3.21",
      "free": false,
      "date": "2025-04-07",
      "content": "- Add Mila level 4 and 5.\n- Add footjob scene for Mila.\n- Add sound effects to all the girl scenes, except Cassia. I'm planning to rework Cassia scene into animation, so if things go well, the sound will be implemented at that phase.\n- Add sound effects to notifications.\n- Add Credit button on the main menu.\n- Bug fixes:\n\t- Try to fix \"Bought At\" appearing on selling customer.\n\t- Remove placeholder text on the girls' dialogue.\n\t- Fix several typos in the dialogues.\n\t- Fix upgrade staff not updating the staff description until next day."
   },
   {
      "title": "v0.3.20-hotfix",
      "free": false,
      "date": "2025-03-28",
      "content": "- Fix the hardlock when the game tries to spawn an NPC and finds no eligible NPC."
   },
   {
      "title": "v0.3.19",
      "free": false,
      "date": "2025-03-25",
      "content": "- Add new titjob scene for Rina.\n- Add Mila story progress, increasing her max level to 3. Her level 3 also unlock a new outfit for her.\n- Improvements have been made to NPC generation, guaranteeing their spawn within 3 days. A weighted spawn rate has also been applied to ensure a more balanced spawn rate, minimizing the impact of bad RNG and preventing certain NPCs from spawning.\n- Add an incremental chance for each failed attempt at the Mila repair event. In the current state, there should be at least one repair made per week. All other chance-based events in the future should use this new method to prevent bad RNG from happening.\n- Items can now be marked as \"not for sale\" to prevent customers from buying them. \n\t- This feature is intended to help the player save items that they want Mila to repair.\n\t- Customers will try to search for available items up to 3 times, and if all of the items are not for sale, the customer will decide not to buy anything.\n\t- If the player marks all of their items as \"not for sale\", this will not prevent buying customers from spawning. Instead, they will still spawn, decide to not buy anything, and then leave, using up the day's customer quota.\n- Balancing:\n\t- Reduce Mila weekly cost at all level.\n- Bug Fixes:\n\t- Fix the issue where Mila's repaired item shows a reduced estimation compared to before the repair.\n\t- Fix Cara crop top with skirt outfit showing wrong outfit."
   },
   {
      "title": "v0.3.18",
      "free": false,
      "date": "2025-03-09",
      "content": "- New staff Mila, Rina's daughter, will be unlocked after Rina reaches level 7, the current max level for her. Mila will repair items in your inventory until a certain condition based on her level. This enables the player to buy an item in bad condition and let Mila repair it to get a higher profit. Upon successful repair, Mila will trigger a notification that shows the item's name and its estimated value before and after the repair (your stats still determine the accuracy of this estimation).\n- Shop is now upgradable to level 4 to support 2 staff at once and bigger inventory.\n- Add notification UI on the left of the screen, currently it will remind the player for shop weekly expenses at day 7, and when Mila successfully repaired an item in the shop.\n- Balancing:\n\t- Reduce the requirement for Zahra initial spawn.\n\t- Adjust shop stats at level 1-3.\n- QoL:\n\t- All customer scene now showed on the dialogue.\n\t- Tweak the focus on the shop UI while navigating using the arrow keys and Tab/Shift+Tab.\n\t- Add checkmark on customer scene that have been played at least once.\n\t- Add a very simple animation in player h bar\n- Bug fixes:\n\t- Fix customer scenes not showing repeat option.\n\t- Fix mood modal showing the actual mood information when it's actually hidden.\n\t- Fix wrong condition text color in inventory menu.\n\t- Fix weekly cost text moved to the left on max level staff.\n\t- Fix upgrade button showed on a staff that is not hired.\n\t- Fix Adelee max level capped at 4, preventing her naked outfit to be unlocked"
   },
   {
      "title": "v0.3.17",
      "free": false,
      "date": "2025-02-24",
      "content": "- More of Rina's story has been added, along with a new scene where MC can masturbate to her.\n- Rina will have more outfit options as her story progresses.\n- The customer and NPC menu has been updated to match the staff menu layout, supporting outfit variants for customers and NPCs.\n- Asking a customer to get naked will now strip them if their outfit has a strip variant (topless, pantless, exposed). The customer will be fully naked after being asked a second time. This is currently only available on some of Cara's new outfits, with more to come in future updates.\n- 9 new outfits have been added for Cara, some of which have variants like topless or pantless.\n- New expressions have been added for Cara.\n- QoL:\n\t- NPCs are now reordered based on their unlock timing.\n- Bug fixes:\n\t- UI bugs on the customer, NPC, and staff menu UI have been fixed.\n\t- Wrong name in Cassia dialogue."
   },
   {
      "title": "v0.3.16",
      "free": false,
      "date": "2025-02-09",
      "content": "- Add Marie sex scene.\n- Add sneak peek for new NPC, Rina, a single mother. The story is still on development.\n- Add cum on Marie after her sex scene.\n- Customer will stay naked after the scene end, unless the dialogue tell them otherwise.\n- QoL:\n\t- Reduce dialogue box size on some preset.\n- Bug fixes:\n\t- Fix Kline sex scene start over bugged to Jacqueline sex scene.\n\t- Fix price confirmation bug on price higher than 1000.\n\t- Fix unhandled branch dialogue bug when player reject customer after scene price bargain, and then accept customer offer to reconsider their offer by getting naked."
   },
   {
      "title": "v0.3.15-hotfix",
      "free": false,
      "date": "2025-01-29",
      "content": "- Bug fixes:\n\t- Fix several game data issues on new game, one of the problem is perk not unlocking until restart.\n\t- Fix mood button showing when the mood is not unlocked yet.\n\t- Fix Bethany unlocked at day 6 instead of 5.\n\t- Hide UI when an event start at the home, for example when Cassia is explaining about mood on the customers.\n\t- Fix spamming space on the start of an event on the home skipping it entirely to next day.\n- QoL:\n\t- Add confirmation box when you're about to spend at least 3 times of the item estimation when buying from the customer."
   },
   {
      "title": "v0.3.14",
      "free": false,
      "date": "2025-01-25",
      "content": "- Add new sex scene for Adelee.\n- Add cum on customer sprite after scene for Adelee and Kline.\n- Add Horny mood for customers. Currently, for most of the customer, this mood will unlock at h level 4. When the customer is in horny mood, they have higher chance to offer scene to player, and instead of bargaining for better price with player, they are willing to accept worse price for a steamy exchange, meaning higher profit. For example when the customer is selling, they will lower the price if the player want to bang her.\n- Add horny dialogue variant for all the customers. There might be some issue with this since there's a lot of dialogue flow changed, let me know if you experiencing any issues.\n- Change how \"ask naked\" choice works on customers, now the player can choose what to do after the customer get naked rather than fixed to giving a counter offer. 🙌\n- Add ask to get naked option on buying customer on h level 3(with the perk unlocked). On selling customer this option is available as soon as the perk is unlocked.\n- Add ask to get naked choice on Gabrielle sell dialogue.\n- QoL:\n\t- Add mood explanation button at the right of the mood text.\n- Balancing:\n\t- Increasing h level on customer now will lower their \"scene price\".\n- Bug Fixes:\n\t- Fix customer not offering scene to player due to broken perk check code.\n\t- Fix rejecting customer scene offer leading to premature dialogue end."
   },
   {
      "title": "v0.3.13-hotfix",
      "free": false,
      "date": "2025-01-15",
      "content": "- Change how the game exported to prevent false positive virus detection by windows defender, I hope it's not coming back.\n- Add ask naked on Louisa sell dialogue.\n- Balancing:\n\t- Increase NPC spawn chance.\n- Bug fixes:\n\t- Fix Cassia addressing MC as Pawloo instead of the custom name.\n\t- Fix player perk not unlocking properly.\n\t- Fix customer h-bar UI not showing on the day intoxicating cum perk unlocked.\n\t- Fix customer h-bar UI not updated right after the scene end.\n\t- Fix several bugs on NPC Blacklist feature:\n\t\t- Right click to toggle blacklist not working.\n\t\t- NPC Blacklist system itself not working properly.\n\t\t- Removing NPC blacklist not working."
   },
   {
      "title": "v0.3.12",
      "free": false,
      "date": "2025-01-12",
      "content": "- Add new sex scene for Kline.\n- Add H level to the customer (from intoxicating cum perk).\n- Add free customer outfit unlock based on customer H level or other stats. Most of the current customer outfit now have free unlock condition.\n- Add NPC blacklist, can be unlocked from Keira the bouncer at level 3.\n- Increase Keira max level to level 3 which unlock:\n\t- New outfit, and older outfit variant\n\t- NPC blacklist feature (max 2).\n- Add variant outfit system, this type of outfit variant is applied only on Keira, for now.\n- Balancing:\n\t- Reduce cost of upgrading stats.\n\t- Increase some outfit cost in response of free unlock feature."
   },
   {
      "title": "v0.3.11-hotfix",
      "free": false,
      "date": "2025-01-07",
      "content": "- Fix Zahra BJ start over leading to different scene.\n- Fix Bethany dialogue showing some bb code."
   },
   {
      "title": "v0.3.10-hotfix",
      "free": false,
      "date": "2024-12-29",
      "content": "-Fix Start Over on Thea sex scene leading to another scene.\n- Fix Bethany cum count bug."
   },
   {
      "title": "v0.3.9",
      "free": false,
      "date": "2024-12-29",
      "content": "- Add more of Zahra story with her blowjob scene in it.\n- Add Thea sex scene.\n- Add 18 new items\n- Add new perk \"Intoxicating Cum\" which can be obtained from Zahra story. When this perk is unlocked, player can make the customers more corrupted(still on development), for example, increasing the corruption will unlocking new mood and give free outfit unlock.\n- Add repeat dialogue for Louisa sex scene.\n- Add cum on customer sprite after scene:\n\t- Miyuki blowjob, titjob, and sex scene.\n\t- Louisa sex scene.\n\t- Jacqueline handjob, blowjob, and sex scene.\n\t- Cara blowjob, and sex scene.\n\t- Gabrielle handjob, blowjob, and sex scene.\n\t- Thea blowjob, titjob, and sex scene\n- Hover at button at the left of item on the table to move the item to the right if needed ;)\n- Add simple text animation on the money when it's changed.\n- Balancing:\n\t- Change cum times needed for soothing ejaculation level 1 from 20 to 30.\n- QoL:\n\t- Add separate dialogue box background color when the girl is talking.\n- Bug fixes:\n\t- Fix typo in Adelee sell dialogue.\n\t- Fix saved number in data tracking for scene h point is after reduction, should be before reduction.\n\t- Fix NPC scene not unlocking properly at the start of a new day.\n\t- Fix customer scene not unlocking properly.\n\t- Fix some game data not saved properly."
   },
   {
      "title": "v0.3.8",
      "free": false,
      "date": "2024-12-14",
      "content": "- New scene:\n\t- Cara sleep sex\n\t- Cara standing sex\n\t- Gabrielle doggy style\n- New npc:\n\t- Zahra\n- Add customer mood. This feature will be unlocked at week 2 when Cassia is talking to you about it at home. Higher insight will increase the chance for mood to be revealed. Current mood in the game are:\n\t- Normal: the default mood\n\t- Stingy: the customer will have worse price (high when selling, low when buying)\n\t- Generous: the customer will have better price\n\t- In a rush: the customer wouldn't bargain with player but will more tolerate the price given to her. The opening dialogue also slightly changed for some customer when they have this mood.\n- Add new perk:\n\t- Soothing cum: Scene will reduce more h point.\n- Remove old customer assets to decrease the game file size."
   },
   {
      "title": "v0.3.7",
      "free": false,
      "date": "2024-12-01",
      "content": "- Add upgradable shop, currently shop level will affect these stats:\n\t- Item storage\n\t- Daily customer count\n\t- Max active staff, but right now, there's only 1 staff available\n\t- Weekly maintenance cost\n\t- Unlock new content (for future update)\n- Add missionary sex position for Jacqueline with passed out option.\n- Restructure Jacqueline sex scene, adding missionary position and option to change the position in the scene.\n- QoL:\n\t- Change the response position in dialogue so it doesn't block the center of the screen.\n\t- Add new panel preset to swap the position of the dialogue and response option.\n- Bug fixes:\n\t- Fix typo in Louisa sex scene\n\t- Fix Louisa sex scene flag not working as intended."
   },
   {
      "title": "v0.3.6-hotfix",
      "free": false,
      "date": "2024-11-17",
      "content": "- Fix Louisa sex scene cg still showing when another scene played after it in the same day\n- Louisa sex scene dialogue adjustment"
   },
   {
      "title": "v0.3.5",
      "free": false,
      "date": "2024-11-16",
      "content": "- Add 2 new sex scenes for Jacqueline and Louisa.\n\t- Cowgirl position for Jacqueline\n\t- Cowgirl and from behind position for Louisa\n- Add facial expression for these scenes:\n\t- Kline titfuck.\n\t- Jacqueline handjob.\n\t- Louisa nursing handjob.\n- Add multiple cum option for these scene:\n\t- Miyuki titfuck.\n\t- Kline titfuck.\n\t- Jacqueline handjob.\n\t- Jacqueline blowjob.\n\t- Gabrielle blowjob.\n\t- Louisa nursing handjob.\n- Adjustment on cum buildup image for Miyuki sex scene.\n- Add customer & npc scene list and count on their menu.\n- Bug fixes:\n\t- Fix price input cannot be deleted until it's empty.\n\t- Fix typo in customer dialogues.\n\t- Perk unlock string is now hidden when the perk is unlocked.\n\t- Fix shop maintenance cost is not working.\n\t- Fix staff weekly cost not working."
   },
   {
      "title": "v0.3.4",
      "free": false,
      "date": "2024-11-02",
      "content": "- Add 1 new scene Miyuki, the new scene will be the second scene, so the previous sex scene moved as the third scene.\n- Add coom buildup variant for Miyuki sex scene.\n- Add upgrade system to staff, currently only with money.\n- Add body inspection(grope) scene for Keira(bouncer) at level 2.\n- Staff will pick an outfit for the day, the outfit will be randomly picked from unlocked and not blacklisted outfits.\n- Add unlock staff outfit system. Keira(bouncer) outfits will be locked at level 1, and 3 of her outfit can be unlocked at level 2.\n- Add customer outfit blacklist for bouncer at level 2, the bouncer can blacklist customer outfits until 1 active outfit remaining per customer.\n- Add staff outfit blacklist, for staff outfit blacklist, bouncer is not needed, it will always active since you are the boss.\n- Add ability for customers to offer scene to the player when they are selling. It was only available to Miyuki on previous version. The ability and chance to offer scene will differ based on the customer personality (around 15-35%).\n- Add 5 new outfit for Marie.\n- Miyuki chance to offer scene reduced from 50% to 35%.\n- At day 3, add dialogue at home that introduce shop expenses.\n- Adjustment on the tutorial information to keep up with current content.\n- Bug fixes:\n\t- Fix customer blacklist is still working when the bouncer is fired after setting the blacklist list\n\t- Fix typo in several Miyuki scenes\n\t- Fix Miyuki expression not changing in her scene\n- QoL:\n\t- Right click on the customer slot will blacklist the customer\n\t- Right click on the customer outfit slot will blacklist the customer outfit, also work on staff outfit.\n\t- Add information modal for blacklist customer and customer outfit\n- Technical Stuff:\n\t- More unit test to cover more human(me) error"
   },
   {
      "title": "v0.3.3-hotfix",
      "free": false,
      "date": "2024-10-23",
      "content": "- Fix crash from NPC events\n- Fix wrong Bethany unlock condition text"
   },
   {
      "title": "v0.3.2-hotfix",
      "free": false,
      "date": "2024-10-20",
      "content": "- Add option for first time or repeat dialogue on all customers scene. Previously only available to Miyuki.\n- Bug fixes:\n\t- Fix scene option is showing when the required perk is not acquired yet, choosing the option will lead to customer exit the shop immediately.\n\t- Fix customer offering scene to player when the perk is not unlocked yet.\n\t- Disable daily maintenance cost (it was a testing code for me testing daily expenses)"
   },
   {
      "title": "v0.3.1",
      "free": false,
      "date": "2024-10-19",
      "content": "- Add new unlockable customer Miyuki. She comes with 17 outfit and 2 scenes. There's also 2 new improvement feature coming with her, which will be applied to other customers in next update.\n\t- Customer can offer their scene to the player. Miyuki have this set at 50%.\n\t- Customer scene have first time and repeat option\n- Lillian at level 4 now have 50% chance to give player a random low price item.\n- Changed how customer data is tracked, customer data will be reset because of this. This is required as a base for changeable customer name, and future(maybe) swappable customer personality.\n- Change how customer scene are unlocked, this will make all customer scenes back to locked (you need to play the first scene again to unlock it). This will also make certain customer scene can be unlocked with special condition, for future content.\n- Fix some grammar mistakes on the prologue\n- QoL update:\n\t- Dialogue panel preset now remembered and saved.\n\t- Add keyboard key function on summary page and management UI.\n\t- Add blacklist indicator on the blacklisted customer.\n- Bug fixes:\n\t- Fix locked customer, NPC and staff showing their available/default outfit\n\t- Fix price input allowing letter to show\n\t- Fix starting price on buying customer is started by current money instead of the item expected price. This bug happened on buying customer after a selling customer exit the shop.\n\t- Fix money UI not updated in the shop\n\t- Fix background and cassia sprite messed up in home\n\t- Fix customer outfit UI not resetting properly when reopened\n\t- Fix customer outfit name changing when unlocking an outfit\n\t- Fix typo on customer dialogues\n\t- Fix several bugs with summary calculations\n\t- Fix \"better focus\" perk not unlocked properly"
   },
   {
      "title": "v0.3.0",
      "free": false,
      "date": "2024-10-06",
      "content": "- Change day system to day-week-month. Old day will be converted automatically at the start of the game.\n- Add summary report at the end of the day. There's daily, weekly, and monthly report added.\n- Add staff menu. Player can manage(hire, fire, and talk) their staff at the end of the day.\n- Add new staff (bouncer), she will enable customer blacklist feature if active, she also will make customer at the shop more patient. The dialogue and scene on the staff will come in later release.\n- Add blacklist feature when bouncer is in active staff. Current maximum customer that can be blacklisted is 2 (will be upgradable in future).\n- Add weekly staff and shop maintenance cost.\n- Add new information at tutorial about auto save, and the new staff feature.\n- H reduction now will get higher depend on the event level\n- Adjustment on customer management UI for blacklist feature."
   },
   {
      "title": "v0.2.2",
      "free": false,
      "date": "2024-09-21",
      "content": "- Add first time and repeat dialogue for all customers scene dialogues.\n- Customer now can offer their selling price first (currently at 25% chance on selling only)\n- Add 5 new customer scenes, on Gabrielle, Jacqueline, Marie, Cara, and Thea. The scenes are mostly blowjob for each customer. Each customer now have 2 scene, making it 16 customer scenes in total.\n- Level 2 scene now will be unlocked after level 1 scene played at least once. It was all unlocked before as long as you have the perks. This will also apply on the future scene at level 3, 4...\n- Fix scene perk not used to activate scene on majority of the customers.\n- Fix broken player data on day 1 when starting a new game.\n- Fix replay scene not resetting some element.\n- Tweak Gabrielle scene cg and dialogues.\n- Fix grammar mistakes."
   },
   {
      "title": "v0.2.1-hotfix",
      "free": false,
      "date": "2024-09-10",
      "content": "- Fix messed scene cg system."
   },
   {
      "title": "v0.2.0",
      "free": false,
      "date": "2024-09-07",
      "content": "- Add NPC Information menu to see currently available NPC, their level, and condition to progress their level.\n- Add player H level which will increase in time according to event that happened. If this level get too high, player stats will reduced, making player harder to make money. This can be reduced by getting \"help\" from anyone.\n- Add new perk related to new H level feature.\n- Add new NPC (police). She will start coming after day 4.\n- MC name is now editable in player menu.\n- Add buttons at the shop to access management menu, and inventory. I guess at this point it's fully playable with one hand, lol. But, there's still a lot of room for improvement for sure.\n- Tune the balance to make it easier to make money.\n- QoL: Disable auto focus on first response at dialogue. This is to prevent accidental response taken when player is spamming space or enter. To select first response, use down/right/tab arrow can be used, to select last response use up/left/shift+tab can be used.\n- QoL: Add color to price input to help player decide on profit/loss on the transaction. It will be green if the price is good, red if it's bad. If the customer is buying, the price will be green when it's higher than the price player bought the item at(profit), red if lower(loss). If the customer is selling, the price will be green when it's lower than the player expected price(potential profit), red if higher(potential loss). Remember, mc expected price can be way off if the competence stats is low.\n- QoL: Add keyboard support at main menu. With default focus on load game, if save game exist, and start new game in case of no save detected.\n- QoL: Add keyboard support at home (after shop). With default focus on the next day button, so player can just enter to enter new day.\n- Update tutorial to cover new features.\n- Tweak Lillian dialogue.\n- Tweak price change step.\n- Fix bug where Lillian level reset when player money is under 2000.\n- Fix pawloo name appeared instead of custom name.\n- Fix typo and grammar mistake in customer dialogues.\n- Fix repeating dialogue bug on some customer.\n- Fix stats bug not retrieving the correct value on customer and player."
   },
   {
      "title": "v0.1.3",
      "free": true,
      "date": "2024-08-24",
      "content": "- Add ingame changelog viewer\n- Add new version notification at the main menu if there's a new version available\n- Add supporter button on the home\n- Remove supporter button from the option menu"
   },
   {
      "title": "v0.1.2",
      "free": true,
      "date": "2024-08-23",
      "content": "- Add unlockable perk to unlock sexy scenes on the shop. Perk detail can be seen at the player stats menu, you can see it on the shop press \"Q\" menu.\n- Add unique buy/sell dialogue for all 8 customer. The flow mainly stay the same, the goal is for dialogue to match the customer personality.\n- Add variety of face expression to all 8 customer. This expression tied to their own dialogue and event at the shop.\n- Add small customer dialogue variations. Example:\n\t- Louisa can get naked on her own to persuade you to give better price or when you reject her. \n\t- When haggling with Kline, when she's selling item, you can ask her to get naked as a requirement to consider her item. Ask naked option is not available if the customer is wearing naked outfit and the perk is unlocked.\n- Increase price on more revealing outfit. The outfit price is now in range of 200-500.\n- Increase starting money to 5000.\n- Increase customer price calculation result on lower greed. (Make it easier to make money)\n- QoL: Add new dialogue panel (press J to toggle) for playing portrait orientation scene without blocked by the dialogue panel\n- QoL: Add auto focus on price field when haggling to enable player to immediately change their price\n- QoL: Up and down arrow key can be used to change price when haggling\n- QoL: Mouse scroll wheel can be used to change price when haggling when the mouse pointer is on the price box at the bottom right area\n- QoL: enable ctrl (skip dialogue) to shop\n- Changed font, I found some problem with previous font, so I decide to change it to another font for now.\n- Fix buying customer price is not affected by their stats, they always use the item base value as if they have max stats and make the game harder lol.\n- Fix event npc color marker being same color as buying customer\n- Fix Lillian ask naked dialogue messed up when player immediately give her nothing\n- Fix shop button still clickable while being disabled, causing space cannot be used to advance the dialogue\n- Tweak Lillian response order\n- Add option to skip Lillian dialogue at the start of her dialogue"
   }
]
